# # 1) '''Рекурсивное вычисление числа Фибоначчи: Напишите функцию, которая рекурсивно вычисляет n-ное число Фибоначчи.'''
# def fib(n):
#   if n in (1, 2):
#     return 1
#   return fib(n - 1) + fib(n - 2)
# print (fib(8))

# # 2) '''Рекурсивный расчет факториала: Напишите функцию, которая рекурсивно вычисляет факториал числа.'''
# def fnc1(n):
#     if n in (0,):
#         return 1
#     return fnc1(n-1) * n
# print(fnc1(3))


# # 3) '''Рекурсивное вычисление степени числа: Напишите функцию, которая рекурсивно вычисляет a в степени b.'''
# def fnc1(a,b):
#     if b == 0:
#         return 0
#     return a*fnc1(b-1)
# print(fnc1(2, 4))#####-

# # 4) '''Сортировка списка: Напишите функцию для сортировки списка чисел без использования встроенных функций сортировки.'''


# # 5) '''Рекурсивный подсчет элементов в списке: Напишите функцию, которая рекурсивно подсчитывает количество элементов во вложенных списках.'''

# # #

# # 6) '''Поиск всех подстрок: Напишите функцию, которая находит все вхождения подстроки в строку и возвращает их индексы.'''

# # #

# # 7) '''Генератор последовательности простых чисел: Напишите функцию-генератор, который возвращает последовательность простых чисел.'''

# # #

# # 8) '''Кэширование результатов: Напишите функцию, которая кэширует результаты вычислений, чтобы избежать повторных вычислений для одних и тех же аргументов.'''

# # #

# # 9) '''Граф обхода: Напишите функцию, которая выполняет обход графа в глубину или в ширину, начиная с заданной вершины.'''

# # #